app/Players.php

update `players` set `url_segment` = 'aaron-jones-227' where `id` = 227
---
    public function getUrlSegment()
    {
        // Create URL segment if we don't have one.
        if(!$this->url_segment){
            $this->url_segment = str_slug($this->getFullName().' '.$this->id);
            $this->save();