app/Http/Controllers/PageController.php

select * from `leagues` where `leagues`.`id` in (1, 2, 4)
select * from `teams` where `teams`.`id` in (1, 2, 3, 5, 7, 8, 9, 10, 11, 12, 13, 14, 18, 19, 20, 21, 24, 27, 28, 29, 32, 37, 38, 42, 44, 45, 46, 47, 49, 50, 51, 52, 53, 55, 57, 58, 59, 60, 94, 95, 96, 97, 98, 99, 100, 103, 104, 105, 106, 109, 110, 111, 113, 114, 115, 116, 117, 118, 120, 122)
---
    public function index()
    {

        // Get id's of teams with recent highlights and order by count
        $teamIds = Highlights::select('team_id', \DB::raw('COUNT(id) as total'))
            ->where('created_at', '>', Carbon::now()->subHours(36))
            ->groupBy('team_id')
            ->orderByDesc('total')
            ->take(5)
            ->pluck('team_id');

        if(!$teamIds) {
            $teamIds = Highlights::where('created_at', '>', Carbon::now()->subHours(72))
                ->take(5)
                ->pluck('team_id');
        }

        // Get Teams
        $teamsWithHighlights = Teams::whereIn('id', $teamIds)->get();
        $teamsWithHighlights->load(['league']);