app/Http/Controllers/SearchController.php

select * from `teams` where `league_id` = 3 order by `nickname` asc
---
    public function index($leagueName, $teamName = null, $gameUrlSegment = null)
    {
        $selectedLeague = Leagues::where('name', $leagueName)->orderBy('name')->firstOrFail();
        $teams = Teams::where('league_id', $selectedLeague->id)->orderBy('nickname')->get();

select * from `games` where `id` in (10154, 10155, 10115, 10119, 10120, 10069, 10070, 10061, 10073, 10031) and exists (select * from `tweet_logs` where `games`.`id` = `tweet_logs`.`game_id`) order by `start_date` desc
---
                case 'Games':
                    $games = Games::whereIn('id', $ids)->whereHas('highlights')->orderBy('start_date', 'DESC')->get();
                    $games->load(['homeTeam', 'awayTeam', 'league']);
                    $games->map(function($game)use($models){
                        $models->push([
                            'url' => $game->url(),
                            'label' => $game->homeTeam->nickname.' vs '.$game->awayTeam->nickname.' ('.$game->start_date->format('n/j/y').')',
                            'icon' => $game->league->icon(),
                            'category' => 'Games'
                        ]);
                    });