app/Http/Controllers/SearchController.php

select * from `leagues` where `name` = 'mlb' order by `name` asc limit 1
select * from `leagues`
select * from `teams` where `league_id` = 2 and `nickname` = 'white sox' limit 1
---
    public function index($leagueName, $teamName = null, $gameUrlSegment = null)
    {
        $selectedLeague = Leagues::where('name', $leagueName)->orderBy('name')->firstOrFail();

        $leagues = Leagues::all();
        foreach($leagues as $league) {
            $leagueOptions[] = [
                'url' => url('/'.$league->name),
                'label' => strtoupper($league->name),
            ];
        }

        $breadcrumbs[] = [
                'url' => url('/'.$selectedLeague->name),
                'name' => strtoupper($selectedLeague->name),
        ];

        $highlightsQuery = Highlights::whereHas('team', function($q) use($selectedLeague) {
            $q->where('league_id', $selectedLeague->id);
        });

        if($teamName) {
            $selectedTeam = Teams::where('league_id', $selectedLeague->id)
                ->where('nickname', str_replace('-', ' ', $teamName))
                ->firstOrFail();

select * from `games` where `url_segment` = 'white-sox-tigers-2019-09-29-1510' limit 1
---
        }

        if($gameUrlSegment) {
            $selectedGame = Games::where('url_segment', $gameUrlSegment)->firstOrFail();

select * from `leagues` where `leagues`.`id` in (1, 2, 3, 4)
select * from `teams` where `teams`.`id` in (12, 22, 51, 72, 105)
select * from `leagues` where `leagues`.`id` in (1, 2, 3)
---
                case 'Teams':
                    $teams = Teams::whereIn('id', $ids)->get();
                    $teams->load(['league']);
                    $teams->map(function($team)use($models){
                        $models->push([
                            'url' => $team->url(),
                            'label' => $team->nickname,
                            'icon' => $team->league->icon(),
                            'category' => 'Teams'
                        ]);
                    });
                    break;
                case 'Leagues':
                    $leagues = Leagues::whereIn('id', $ids)->get();
                    $leagues->map(function($league)use($models){
                        $models->push([
                            'url' => $league->url(),
                            'label' => $league->name,
                            'category' => 'Leagues'
                        ]);
                    });

select * from `players` where `url_segment` = 'jp-crawford-1186' limit 1
select * from `games` where `games`.`id` = 12811 limit 1
select * from `leagues` where `leagues`.`id` = 2 limit 1
select * from `teams` where `teams`.`id` = 55 limit 1
---
    public function player($urlSegment)
    {
        $player = Players::where('url_segment', $urlSegment)->firstOrFail();


        $highlightsPaginated = $player->highlights()->whereHas('game')->orderBy('created_at', 'DESC')->paginate();

        $groupedHighlights = $highlightsPaginated->groupBy(function($highlight){
            return $highlight->game->homeTeam->nickname.' vs '.$highlight->game->awayTeam->nickname;
        })->groupBy(function($gameHighlights){
            return $gameHighlights->first()->game->start_date->format('n/j');
        });

        $data = [
            'highlightsPaginated' => $highlightsPaginated,
            'groupedHighlights' => $groupedHighlights,
            'breadcrumbs' => [
                [
                    'url' => $player->team->league->url(),
                    'name' => strtoupper($player->team->league->name)
                ],
                [
                    'url' => $player->team->url(),
                    'name' => $player->team->nickname
                ],
                [
                    'url' => $player->url(),
                    'name' => $player->getFullName()
                ]
            ],
            'metaTags' => [
                'description' => 'View all '.$player->first_name.' '. $player->last_name.' highlights',
                'url' => $player->url(),
            ]
        ];